## Plan Result (Aks_ithc - DeployInfrastructure)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 3 to change, 1 to destroy.</code></pre>

* Create
  * azurerm_resource_group.disks_resource_group
  * azurerm_role_assignment.disk
* Update
  * module.kubernetes[&#34;00&#34;].azurerm_kubernetes_cluster.kubernetes_cluster
  * module.kubernetes[&#34;00&#34;].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;cronjob&#34;]
  * module.kubernetes[&#34;00&#34;].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;linux&#34;]
* Delete
  * module.kubernetes[&#34;00&#34;].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;spotinstance&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_resource_group.disks_resource_group will be created
  + resource "azurerm_resource_group" "disks_resource_group" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "disks-ithc-rg"
      + tags     = {
          + "application"  = "core"
          + "autoShutdown" = "true"
          + "builtFrom"    = "hmcts/aks-cft-deploy"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "ithc"
        }
    }

  # azurerm_role_assignment.disk will be created
  + resource "azurerm_role_assignment" "disk" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "fcf1fd52-1e62-4827-b8f7-7088bc9dd488"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Virtual Machine Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.kubernetes["00"].azurerm_kubernetes_cluster.kubernetes_cluster will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "kubernetes_cluster" {
      ~ azure_policy_enabled                = true -> false
        id                                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-00-rg/providers/Microsoft.ContainerService/managedClusters/cft-ithc-00-aks"
      ~ kubernetes_version                  = "1.30.11" -> "1.30"
        name                                = "cft-ithc-00-aks"
        tags                                = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/aks-cft-deploy"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "ithc"
        }
        # (35 unchanged attributes hidden)

      ~ default_node_pool {
            name                          = "system"
          ~ orchestrator_version          = "1.30.11" -> "1.30"
            tags                          = {
                "application"  = "core"
                "autoShutdown" = "true"
                "builtFrom"    = "hmcts/aks-cft-deploy"
                "businessArea" = "CFT"
                "criticality"  = "Medium"
                "environment"  = "ithc"
            }
            # (29 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (9 unchanged blocks hidden)
    }

  # module.kubernetes["00"].azurerm_kubernetes_cluster_node_pool.additional_node_pools["cronjob"] will be updated in-place
  ~ resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
        id                            = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-00-rg/providers/Microsoft.ContainerService/managedClusters/cft-ithc-00-aks/agentPools/cronjob"
        name                          = "cronjob"
      ~ orchestrator_version          = "1.30.11" -> "1.30"
        tags                          = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/aks-cft-deploy"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "ithc"
        }
        # (30 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.kubernetes["00"].azurerm_kubernetes_cluster_node_pool.additional_node_pools["linux"] will be updated in-place
  ~ resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
        id                            = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-00-rg/providers/Microsoft.ContainerService/managedClusters/cft-ithc-00-aks/agentPools/linux"
        name                          = "linux"
      ~ orchestrator_version          = "1.30.11" -> "1.30"
        tags                          = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/aks-cft-deploy"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "ithc"
        }
        # (30 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.kubernetes["00"].azurerm_kubernetes_cluster_node_pool.additional_node_pools["spotinstance"] will be destroyed
  # (because key ["spotinstance"] is not in for_each map)
  - resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
      - auto_scaling_enabled          = true -> null
      - eviction_policy               = "Delete" -> null
      - fips_enabled                  = false -> null
      - host_encryption_enabled       = false -> null
      - id                            = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-00-rg/providers/Microsoft.ContainerService/managedClusters/cft-ithc-00-aks/agentPools/spotinstance" -> null
      - kubelet_disk_type             = "OS" -> null
      - kubernetes_cluster_id         = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-00-rg/providers/Microsoft.ContainerService/managedClusters/cft-ithc-00-aks" -> null
      - max_count                     = 5 -> null
      - max_pods                      = 30 -> null
      - min_count                     = 0 -> null
      - mode                          = "User" -> null
      - name                          = "spotinstance" -> null
      - node_count                    = 0 -> null
      - node_labels                   = {
          - "kubernetes.azure.com/scalesetpriority" = "spot"
        } -> null
      - node_public_ip_enabled        = false -> null
      - node_taints                   = [
          - "kubernetes.azure.com/scalesetpriority=spot:NoSchedule",
        ] -> null
      - orchestrator_version          = "1.30" -> null
      - os_disk_size_gb               = 128 -> null
      - os_disk_type                  = "Ephemeral" -> null
      - os_sku                        = "Ubuntu" -> null
      - os_type                       = "Linux" -> null
      - priority                      = "Spot" -> null
      - scale_down_mode               = "Delete" -> null
      - spot_max_price                = -1 -> null
      - tags                          = {
          - "application"  = "core"
          - "autoShutdown" = "true"
          - "builtFrom"    = "hmcts/aks-cft-deploy"
          - "businessArea" = "CFT"
          - "criticality"  = "Medium"
          - "environment"  = "ithc"
        } -> null
      - ultra_ssd_enabled             = false -> null
      - vm_size                       = "Standard_D4ds_v5" -> null
      - vnet_subnet_id                = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ithc-vnet/subnets/aks-00" -> null
      - zones                         = [
          - "1",
          - "2",
          - "3",
        ] -> null
        # (5 unchanged attributes hidden)

      - timeouts {
          - update = "180m" -> null
        }
    }

Plan: 2 to add, 3 to change, 1 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # azurerm_resource_group.disks_resource_group has been deleted
  - resource "azurerm_resource_group" "disks_resource_group" {
      - id         = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/disks-ithc-rg" -> null
        name       = "disks-ithc-rg"
        tags       = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/aks-cft-deploy"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "ithc"
        }
        # (2 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":703,"Program":"tfcmt","SHA1":"","Target":"Aks_ithc - DeployInfrastructure","Vars":{}} -->